Repository: sugarlabs/turtleblocksjs
Catalog: po/*.po
Languages: ar

source: Delete all
ar: حذف الكل

source: show
ar: نص

source: text
ar: نص

source: random
ar: عشوائي

source: confirm
ar: تأكيد

source: rice and beans
ar: الأرز والفول

source: target
ar: اللغة الهدف

source: keyboard
ar: لوحة المفاتيح

source: You can also load projects from the file system.
ar: يمكنك أيضاً تحميل المشاريع من نظام الملفّات.

source: on
ar: في

source: chicken
ar: دجاجة

source: apple
ar: تفاحة

source: number
ar: عدد

source: UID
ar: هويّة فريدة

source: title
ar: عنوان المشروع

source: radians
ar: النظام الدائري

source: Undo
ar: إلغاء الإجراء السابق

source: duration (ms)
ar: المدة الزمنية (بالميكرو ثانية)

source: to
ar: إلى

source: add
ar: أضف

source: set pen size
ar: اضبط حجم القلم

source: start turtle
ar: ابدأ السلحفاة

source: latitude
ar: خط العرض

source: mouse x
ar: الفأرة س

source: mouse y
ar: الفأرة ص

source: Show/hide blocks
ar: إظهار/ إخفاء اللبنات

source: then
ar: ثم

source: move
ar: حرّك

source: Stop the current project.
ar: أوقف المشروع الحالي

source: stop turtle
ar: أوقف السلحفاة

source: food
ar: الطعام

source: Click to run the project in slow mode.
ar: انقر لتنفيذ المشروع بالعرض البطيء.

source: stop
ar: توقف

source: fat
ar: سمين

source: Expand or collapse start and action stacks.
ar: قم بتوسيع أو تقليص أكوام البدء والنشاط.

source: pop
ar: أظهر

source: background
ar: الخلفية

source: not
ar: ليس

source: Google map
ar: خريطة غوغل

source: day
ar: يوم

source: mod
ar: الشكل النمطي

source: Save project
ar: حفظ المشروع

source: get fiber
ar: احصل على الألياف

source: Open a panel for configuring Turtle Blocks.
ar: افتح لوحة لتكوين لبنات السلحفاة.

source: name
ar: الاسم

source: turtle x
ar: السلحفاة س

source: turtle y
ar: السلحفاة ص

source: Download
ar: تحميل

source: The paste button is enabled when there are blocks copied onto the clipboard.
ar: يتم تفعيل زر اللصق عندما يتم نسخ لبنات إلى الحافظة.

source: Expand/collapse toolbar
ar: توسيع/ تقليص شريط الأدوات

source: zoom
ar: تقريب

source: Hide or show the blocks and the palettes.
ar: إخفاء أو إظهار اللبنات أو اللوحات.

source: to degrees
ar: إلى درجات

source: Restore blocks from the trash.
ar: إعادة اللبنات من سلة المهملات.

source: get calories
ar: احصل على سعرات حرارية

source: Load plugin from file
ar: تحميل البرنامج المساعد من الملف

source: You can scroll the blocks on the canvas.
ar: يمكنك تمرير اللبنات على اللوحات.

source: x
ar: س

source: show blocks
ar: أظهر اللبنات

source: heading
ar: الترويسة

source: Help
ar: المساعدة

source: turtle
ar: السلحفاة

source: right
ar: يمين

source: Load samples from server
ar: تحميل عينات من الخادم

source: hide blocks
ar: قم بإخفاؤ اللبنات

source: Hide or show the block palettes.
ar: إخفاء أو إظهار لوحات المنع.

source: This button opens a viewer for loading example projects.
ar: يفتح هذا الزر شاشة عرض لتحميل أمثلة على المشاريع.

source: Enable scrolling
ar: تفعيل التمرير

source: back
ar: رجوع

source: Publish
ar: نشر

source: grey
ar: رمادي

source: arc
ar: قوس

source: radius
ar: نصف القطر

source: longitude
ar: الطول

source: duration
ar: المدة

source: set shade
ar: حدد درجة اللون

source: frequency
ar: التواتر

source: event
ar: في حالة

source: pixel color
ar: لون بكسل

source: This button opens and closes the primary toolbar.
ar: يقوم هذا الزر بفتح وإغلاق شريط الأدوات الأساسي.

source: index
ar: مؤشر

source: hide
ar: إخفاء

source: show heap
ar: أظهر مكونات الكومة

source: Show or hide a Cartesian-coordinate grid.
ar: إظهار أو إخفاء شبكة التنسيق الديكارتي.

source: vspace
ar: الفراغ العامودي

source: publish
ar: نشر المشروع على الفيسبوك

source: forecast
ar: التنبؤات الجوية

source: hours ago
ar: قبل عدة ساعات

source: pen
ar: القلم

source: fish
ar: السمكة

source: print
ar: اطبع

source: heap length
ar: عدد المدخلات التي تكون في الكومة

source: size
ar: الحجم

source: Expand/collapse option toolbar
ar: توسيع/ تقليص شريط الأدوات

source: end hollow line
ar: أنهِ الخط المجوف

source: city latitude
ar: خط عرض المدينة

source: fiber
ar: الألياف الغذائية

source: You can load new blocks from the file system.
ar: يمكنك تحميل لبنات جديدة من نظام الملفات.

source: power
ar: الأس

source: Settings
ar: الإعدادات

source: one of
ar: أحد

source: Save stack
ar: قم بتخزين الكومة

source: corn
ar: ذرة

source: Display statistics
ar: أظهر الإحصاءات

source: Remove all content on the canvas, including the blocks.
ar: قم بإزالة المحتويات الموجودة على اللوحات, بما في ذلك اللبنات.

source: to radians
ar: إلى النظام الدائري

source: water
ar: الماء

source: base
ar: الأساس

source: cookie
ar: ملفات تعريف الارتباط

source: Show or hide a polar-coordinate grid.
ar: إخفاء أو إظهار شبكة التنسيق القطبي.

source: sweet potato
ar: البطاطا الحلوة

source: save heap
ar: قم بتخزين الكومة

source: from
ar: من

source: sensors
ar: الحسّاسات

source: pen down
ar: احتجز

source: index heap
ar: قيمة (مؤشر) الكومة

source: get name
ar: احصل على الاسم

source: wait
ar: انتظر

source: box
ar: صندوق المتغير

source: Planet
ar: كوكب

source: Show these messages.
ar: أظهر هذه الرسائل.

source: obj
ar: كينونة

source: store in
ar: خزن القيمة في الصندوق

source: digest meal
ar: هضم الوجبة

source: maths
ar: الرياضيات

source: popout
ar: الصندوق المنبثق

source: zoom factor
ar: عامل التقريب

source: action
ar: الإجراء

source: loudness
ar: درجة الصوت

source: Increase the size of the blocks.
ar: زيادة حجم اللبنات

source: or
ar: أو

source: sense left
ar: استشعار الأشياء الموجودة إلى اليسار

source: comment
ar: تعليق

source: cheese
ar: جبنة

source: Cartesian
ar: الديكارتي

source: tone
ar: نبرة الصوت

source: eval
ar: قيّم

source: color
ar: اللون

source: image
ar: الصورة

source: Welcome to Turtle Blocks
ar: مرحباً بك في لبنات السلحفاة

source: Increase block size
ar: قم بزيادة حجم اللبنات

source: This toolbar contains the palette buttons, click to show the palettes of blocks and drag blocks from the palettes onto the canvas to use them.
ar: يحتوي شريط الأدوات هذا على أزرار اللوحة, انقر لإظهار لوحات اللبنات واسحبها من اللوحات إلى اللوحات الأخرى لاستخدامها.

source: pen size
ar: حجم القلم

source: Clear the screen and return the turtles to their initial positions.
ar: نظف الشاشة وأعد السلاحف إلى مكانها الأساسي.

source: boolean
ar: القيمة المنطقية

source: coordinates
ar: الإحداثيات

source: sing
ar: غنِّ

source: Congratulations.
ar: تهانينا

source: Run slow
ar: نفذ ببطء

source: mouse button
ar: زر الفأرة

source: cloud
ar: السحابة

source: speak
ar: تحدّث

source: city
ar: مدينة

source: get carbs
ar: احصل على الكربوهيدرات

source: Click to run the project in fast mode.
ar: انقر لتنفيذ المشروع بشكل سريع.

source: beef
ar: لحم بقر

source: source
ar: اللغة المصدر

source: unknown
ar: المجهول

source: wait for
ar: انتظر

source: pen up
ar: احتجز

source: Decrease the size of the blocks.
ar: قم بتقليل حجم اللبنات

source: start
ar: ابدأ

source: stock price
ar: سعر الكومة

source: heap empty?
ar: هل الكومة فارغة؟

source: motion z
ar: حركة ع

source: low
ar: متدنية

source: motion x
ar: حركة س

source: motion y
ar: pv;m w

source: forward
ar: إلى الأمام

source: degrees
ar: الدرجات

source: translate
ar: ترجم

source: until
ar: حتى

source: define
ar: عرّف

source: On my device
ar: على جهازي

source: save svg
ar: حفظ المشروع كرسم متجه بسيط (SVG)

source: ceiling
ar: السقف

source: shell
ar: صدفة السلحفاة

source: blink (ms)
ar: رمشة (بالميكرو ثانية)

source: that
ar: ذلك

source: set lang
ar: اضبط اللغة

source: turtle name
ar: اسم السلحفاة

source: carbs
ar: الكربوهيدرات

source: else
ar: أخرى

source: broadcast
ar: بث

source: orange
ar: برتقال

source: begin hollow line
ar: ابدأ الخط المجوف

source: heap
ar: الكومة

source: begin fill
ar: ابدأ بملء اللون

source: sense right
ar: الاستشعار بشيء موجود إلى اليمين

source: eat
ar: يأكل

source: Expand/collapse collapsable blocks
ar: توسيع/ تقليص اللبنات القابلة للتقليص

source: high
ar: مرتفعة

source: Coordinate data not available.
ar: بيانات الإحداثيات غير متوفرة

source: set hue
ar: تحديد درجة اللون

source: currency
ar: العملة

source: this
ar: هذا

source: hspace
ar: الفراغ الأفقي

source: potato
ar: البطاطا

source: city longitude
ar: طول المدينة

source: Click to run the project step by step.
ar: انقر لتنفيذ المشروع خطوةً خطوة.

source: value
ar: قيمة المتغير

source: banana
ar: موز

source: wheat bread
ar: خبز قمح

source: Turtle Blocks is a Logo-inspired turtle that draws colorful pictures with snap-together visual-programming blocks.
ar: لبنات السلاحف هي شعارات مستوحاة من السلاحف ترسم الصور الملونة مع لبنات البرمجة المرئية المجموعة معاً.

source: while
ar: ريثما

source: open file
ar: فتح الملف

source: detect lang
ar: اكتشف اللغة

source: cake
ar: الكعك

source: exp
ar: الأس

source: load heap
ar: حمّل الكومة

source: Open
ar: افتح

source: fetch
ar: الاستحضار

source: see distance
ar: حدد المسافة

source: and
ar: و

source: set grey
ar: اختر الرمادي

source: do
ar: أجرِ

source: calories
ar: السعرات الحرارية

source: Run step by step
ar: نفذ خطوةً خطوة

source: Show/hide palettes
ar: إظهار/ إخفاء اللوحات

source: set heading
ar: حدد الترويسة

source: add 1 to
ar: أضف 1 إلى

source: stop play
ar: أوقف العرض

source: protein
ar: بروتينات

source: play back
ar: شغل

source: if
ar: إذا

source: Save your project to a server.
ar: احفظ مشروعك على خادم

source: Decrease block size
ar: قلل حجم اللبنة

source: angle
ar: زاوية

source: get fat
ar: اكسب المزيد من الوزن

source: min
ar: الأدنى

source: media
ar: وسائل الإعلام

source: Stop
ar: أوقف

source: sqrt
ar: الجذر التربيعي

source: click
ar: انقر

source: note
ar: ملاحظة

source: field
ar: مجال الاهتمام

source: Palette buttons
ar: ازرار اللوحة

source: set xy
ar: حدد س ص

source: end fill
ar: أنه تعبئة اللون

source: Copy
ar: نسخ

source: Paste
ar: لصق

source: Delete
ar: حذف

source: tamale
ar: تامالي

source: Worldwide
ar: في جميع أنحاء العالم

source: repeat
ar: كرر

source: blocks
ar: لبنات

source: Display statistics about your Turtle project.
ar: اعرض الإحصائيات المتعلقة ببرنامج السلحفاة.

source: Polar
ar: قطبي

source: max
ar: القصوى

source: logic
ar: منطقي

source: empty heap
ar: قم بتفريغ الكومة

source: You have finished the tour. Please enjoy Turtle Blocks!
ar: لقد انتهت الجولة. الرجاء الاستمتاع بلبنات السلحفاة!

source: push
ar: ادفع قيمة إلى أعلى الكومة

source: Clean
ar: نظف

source: set color
ar: حدد اللون

source: Run fast
ar: شغل بشكل سريع

source: broccoli
ar: بروكولي

source: stop media
ar: أوقف العرض

source: tomato
ar: طماطم

source: forever
ar: إلى الأبد

source: note to frequency
ar: النغمة إلى التردد

source: no background
ar: بدون خلفية

source: Load project from file
ar: حمل المشروع من الملف

source: get protein
ar: hpwg ugn hgfv,jdk

source: clear
ar: نظف الشاشة

source: floor
ar: دالة الجزء الصحيح

source: flow
ar: تدفق

source: Click this button to expand or collapse the auxillary toolbar.
ar: انقر على هذا الزر لتوسيع أو تقليص شريط الأدوات المساعد.

source: extras
ar: إضافات

source: shade
ar: درجة اللون

source: time
ar: الوقت

source: y
ar: ص

source: set heap
ar: حدد القيمة المدخلة إلى الكومة

source: hello
ar: مرحباً

source: left
ar: يسار
