Repository: sugarlabs/turtleblocksjs
Catalog: po/ach.po
Languages: ach

source: clear
ach: ywe

source: forward
ach: anyim

source: right
ach: tung cem

source: back
ach: cen

source: left
ach: tung cam

source: angle
ach: tike

source: radius
ach: radias

source: set heading
ach: ter wie madongo

source: heading
ach: radias

source: set xy
ach: ter xy

source: set color
ach: ter rangi

source: color
ach: rangi

source: set hue
ach: ter gi lingo

source: set shade
ach: ter puu

source: shade
ach: puu

source: set grey
ach: ter buruburu

source: grey
ach: buruburu

source: set pen size
ach: ter cajji pa kalam

source: pen size
ach: cajji pa kalam

source: pen up
ach: coo

source: pen down
ach: pe i coo

source: begin fill
ach: cak pong

source: end fill
ach: gik pong

source: background
ach: cal ma i yonge

source: random
ach: cudo

source: min
ach: mamite

source: max
ach: mamite kikome

source: and
ach: ki

source: or
ach: ki

source: not
ach: pe

source: store in
ach: gwok ii

source: name
ach: nying

source: value
ach: berne

source: box
ach: canduk

source: action
ach: tute

source: do
ach: tim

source: start
ach: cak

source: add 1 to
ach: med 1 bot

source: add
ach: med

source: to
ach: bot

source: speak
ach: lok

source: show
ach: nyut

source: size
ach: cajji

source: text
ach: nyig coc

source: shell
ach: gure

source: image
ach: cal

source: stop media
ach: juk kakube

source: repeat
ach: nwo

source: forever
ach: pinaka

source: stop
ach: juk

source: if
ach: ka

source: then
ach: eka

source: until
ach: nioo

source: wait for
ach: kur pi

source: while
ach: kun

source: else
ach: mukene

source: wait
ach: kur manok

source: print
ach: goo

source: time
ach: caa

source: mouse x
ach: ladic x

source: mouse y
ach: ladic y

source: mouse button
ach: mapeca me diyo

source: pixel color
ach: dul rangi

source: unknown
ach: pengene

source: Welcome to Turtle Blocks
ach: Wajoli i Bulok me Tuku

source: Turtle Blocks is a Logo-inspired turtle that draws colorful pictures with snap-together visual-programming blocks.
ach: Bulok me Tuku obedo Logo-ocukuro cwiny tuku magoyo cal maleng adada ki cal-kacel bulok me miyo purugram-kompiuta.

source: Palette buttons
ach: mapeca me kagwoko

source: This toolbar contains the palette buttons: click to show or hide the palettes of blocks (Turtle, Pen, Numbers, Boolean, Flow, Blocks, Media, Sensors, and Extras). Once open, you can drag blocks from the palettes onto the canvas to use them.
ach: Barjami tic man tye ki mapeca me gwoko: dii nyut nyo kaan kagwok me buke (Tuku, Kalam, Namba, Boolean, Mol, Bulok, Kakube, Lapoo wic, ki Mukene mapol). Teki oyabo, i twero diro bulok aa ki kagwoko i kom kanvas pi tic kwedgi.

source: Expand/collapse toolbar
ach: Nyaa ie/bar me tic ma obale

source: This button opens and closes the primary toolbar.
ach: Mapeca man yabo ki loro woko jami tic matye.

source: Run fast
ach: Wot madwir

source: Click to run the project in fast mode.
ach: Dii wek i ket purujek ii kit madwir adada.

source: Run slow
ach: Wot mot

source: Click to run the project in slow mode.
ach: Dii wek mii purujek wot maber ii kit me motmot.

source: Run step by step
ach: Wot yadi acel acel

source: Click to run the project step by step.
ach: Dii wek mii purujek tii yadi acel acel.

source: Stop
ach: Juk

source: Stop the current project.
ach: Juk purujek matye.

source: Clean
ach: Jwaa

source: Clear the screen and return the turtles to their initial positions.
ach: Jwa wang kio ci i dwogo tuku i kabedo mamegi kikome.

source: Show/hide palettes
ach: Nyut/kan lingo

source: Hide or show the block palettes.
ach: Kan nyo nyut geng lingo.

source: Show/hide blocks
ach: Nyut/kan geng

source: Hide or show the blocks and the palettes.
ach: Kan nyo nyut geng ki lingo.

source: Expand/collapse collapsable blocks
ach: Nyaa ie/bal geng matwero bale

source: Expand or collapse stacks of blocks, e.g, start and action stacks.
ach: Nyaa nyo bal omoko pi geng, lapore, cak ki tute omoko.

source: Help
ach: Kony

source: Show these messages.
ach: Nyut kwena magi.

source: Expand/collapse option toolbar
ach: Nyaa/bal bar me jamitic me ayera

source: Click this button to expand or collapse the auxillary toolbar.
ach: Dii mapeca wek nyaa nyo bal cwak me bar jamitic.

source: Paste
ach: Dan

source: The paste button is enabled then there are blocks copied onto the clipboard.
ach: Mapeca me dan tye katic eka tye ie geng ma gikobo i kom bao me coc.

source: Show or hide a Cartesian-coordinate grid.
ach: Nyut nyo kan Jo marwato-kubo layin maogire.

source: Polar
ach: Pola

source: Show or hide a polar-coordinate grid.
ach: Nyut nyo kan pola-kub layin.

source: Load samples from server
ach: Pang lapor aa kii lapok tic

source: This button opens a viewer for loading example projects.
ach: Mapeca man yabo gineno pi pango purujek ma lapor.

source: Load project from file
ach: Pang purujek aa ki pwail

source: You can also load projects from the file system.
ach: I twero dang pango purujek aa ki i katic me pwail.

source: Load plugin from file
ach: Pang rwakyie aa ki pwail

source: You can load new blocks from the file system.
ach: I twero pango geng manyen aa ki i katic pa pwail.

source: Delete all
ach: Jwa lung

source: Remove all content on the canvas, including the blocks.
ach: Kwany lung jami ma ie i kom kanvas, medo ie geng mdpol.

source: Undo
ach: Pe itim

source: Restore blocks from the trash.
ach: Dwogo geng aa ki i bur yugi.

source: Save project
ach: Gwok purujek

source: Save your project to a server.
ach: Gwok purujek bot lapok tic.

source: Congratulations.
ach: Pwoc madit.

source: You have finished the tour. Please enjoy Turtle Blocks!
ach: I tyeko dong limo piny. Tim ber i cam kwo i Bulok me Tuku!

source: hide blocks
ach: kan bulok

source: loudness
ach: dwon malo

source: publish
ach: ket i wiyamo

source: comment
ach: tam amia

source: play back
ach: tuk cen

source: save svg
ach: gwok svg

source: title
ach: nying amia

source: show blocks
ach: nyut bulok

source: stop play
ach: juk tuku

source: turtle
ach: nyang

source: pen
ach: kalam

source: number
ach: namba

source: flow
ach: mol

source: blocks
ach: buloke

source: media
ach: kakube

source: sensors
ach: lapoo wic

source: open file
ach: yab pwail

source: motion z
ach: woti z

source: motion y
ach: woti y

source: motion x
ach: woti x

source: bitcoin
ach: bitkoin

source: from
ach: ki

source: define
ach: gony te

source: stock price
ach: wel jami

source: currency
ach: cente

source: coordinates
ach: kubo

source: zoom factor
ach: kwot ginmo

source: zoom
ach: Kwot

source: latitude
ach: tung malu ki tung piny

source: longitude
ach: tung wok ceng ki poto ceng

source: show heap
ach: nyut dure

source: pop
ach: pye

source: empty heap
ach: dure manono

source: save heap
ach: gwok dure

source: load heap
ach: pang dure

source: push
ach: cor

source: logic
ach: diro moo

source: power
ach: mac

source: base
ach: kema

source: floor
ach: diiot

source: ceiling
ach: ropo

source: degrees
ach: digri

source: to degrees
ach: i digri

source: to radians
ach: i radians

source: maths
ach: cura

source: cheese
ach: cak

source: apple
ach: apul

source: get fat
ach: nong dwolo

source: fish
ach: rec

source: get calories
ach: nong gupu

source: chicken
ach: gweno

source: digest meal
ach: pok yii cam

source: get fiber
ach: nong lwit yat

source: eat
ach: cam

source: rice and beans
ach: mucere ki muranga

source: orange
ach: macunga

source: banana
ach: labolo

source: fiber
ach: lwit yat

source: corn
ach: nywagi mutwo

source: fat
ach: dwolo

source: get carbs
ach: nong cam me kom

source: water
ach: pii

source: cookie
ach: kooki

source: sweet potato
ach: layata

source: broccoli
ach: pot dek

source: wheat bread
ach: mukati ngano

source: tomato
ach: nyanya

source: beef
ach: ringo dyang

source: potato
ach: layata

source: calories
ach: gupu

source: get name
ach: nong nying

source: cake
ach: mugati

source: get protein
ach: nong protein

source: food
ach: dek

source: eatme
ach: cama

source: sense left
ach: giweko woko dul kom mapire tego

source: see distance
ach: nen bor piny

source: sense right
ach: dul kom tung cem

source: sing
ach: wer

source: note
ach: mak maber

source: duration
ach: kare

source: move
ach: dir

source: blink (ms)
ach: ryeny (ms)

source: set lang
ach: ter nying pen

source: source
ach: kama aa ie

source: target
ach: taget

source: translate
ach: gony

source: detect lang
ach: kwed nying pen

source: turtle x
ach: tuku nyang x

source: turtle y
ach: tuku nyang y

source: stop turtle
ach: juk tuku nyang woko

source: turtle name
ach: nying tuku nyang

source: start turtle
ach: cak tuku nyang

source: forecast
ach: lok i gin mapwud pe gineno

source: city
ach: boma madwong

source: day
ach: nino

source: low
ach: piny

source: high
ach: malo
